app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def chooseUser
    @users = User.all