app/controllers/user_suggestions_controller.rb

SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def index
    if cookies.signed[:user_id] == -1
      @division = "N/A"
      @department = "N/A"
      @username = "guest"
      @usersuggestions = UserSuggestion.all
    else
      user = User.find(cookies.signed[:user_id])

SELECT "suggestions".* FROM "suggestions" WHERE ("suggestions"."id" IN (7)) LIMIT 1
---
  def edit
    @suggestion = Suggestion.find_by_id(params[:sugid])

SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def chooseSuggestion
    user = User.find(cookies.signed[:user_id])

SELECT "suggestions".* FROM "suggestions" WHERE ("suggestions"."id" = 8) LIMIT 1
UPDATE "suggestions" SET "suggest" = 'New admin1 suggestion. Updated.', "updated" = '2011-03-30 01:55:36.286613' WHERE ("suggestions"."id" = 8)
---
  def update
    @suggestion = Suggestion.find_by_id(params[:suggestion][:id])
    if @suggestion.update_attributes(
    :suggest => params[:suggestion][:suggest],
    :updated => Time.now)